"CIAdditionCompositing" = "Fügt Farbkomponenten hinzu, um einen Aufhellungseffekt zu erzielen. Dieses Filter wird normalerweise zum Hinzügen von hellen Stellen und Lichtbrechungseffekten verwendet.";"CIAffineClamp" = "Führt eine affine Transformierung auf eine Quelldatei aus und fixiert dann die Pixel am Rand des transformierten Bilds und erweitert sie so nach außen. Dieses Filter arbeitet ähnlich wie das Filter „CIAffineTransform“, jedoch mit dem Unterschied, dass es ein Bild mit unendlicher Ausdehnung erzeugt. Sie können dieses Filter verwenden, wenn Sie ein Bild weichzeichnen möchten, ohne dabei einen weichen, schwarzen Saum entlang der Ränder zu erzeugen.";"CIAffineTile" = "Wendet eine affine Transformierung auf ein Bild an und kachelt das transformierte Bild anschließend.";"CIAffineTransform" = "Wendet eine affine Transformierung auf ein Bild an. Sie können das Eingabebild skalieren, übersetzen oder rotieren. Sie können auch eine Kombination dieser Optionen anwenden.";"CIBarsSwipeTransition" = "Übergang von einem Bild zum nächsten durch Entfernen rechteckiger Ausschnitte des Bilds im Vordergrund, sodass das Zielbild nach und nach sichtbar wird.";"CIBlendWithMask" = "Verwendet eine Graustufenmaske um zwischen einem Bild und dem Hintergrund zu interpolieren. Bei einem Maskenwert von 0,0 resultiert daraus der Hintergrund. Bei einem Maskenwert von 1,0 resultiert daraus das Bild.";"CIBloom" = "Sorgt für weiche Kanten und verleiht dem Bild ein angenehmes Glühen.";"CIBoxBlur" = "Glättet oder schärft die Bilddarstellung mithilfe eines quaderförmigen Faltungskerns.";"CIBumpDistortion" = "Erzeugt eine konkave oder konvexe Struktur, die an einem festgelegten Punkt im Bild entsteht.";"CIBumpDistortionLinear" = "Erzeugt eine Struktur, die aus einem linearen Ausschnitt des Bilds erzeugt wird.";"CICMYKHalftone" = "Erzeugt eine Farb-, Halbtondarstellung des Quellbilds mit Cyan, Magenta, Gelb und Schwarz über einer weißen Seite.";"CICheckerboardGenerator" = "Erzeugt ein Schachbrettmuster. Sie können die Größe und die Farben des Schachbretts sowie die Schärfe des Musters festlegen.";"CICircleSplashDistortion" = "Verzerrt die Pixel, beginnend am Umfang eines Kreises und nach außen ausstrahlend.";"CICircularScreen" = "Simuliert ein konzentrisches Halbtonraster.";"CICircularWrap" = "Windet ein Bild um einen transparenten Kreis herum. Die Verzerrung des Bilds verstärkt sich mit wachsender Entfernung vom Kreismittelpunkt.";"CIColorControls" = "Regelt Sättigungs-, Helligkeits- und Kontrastwerte.";"CIColorCube" = "Verwendet eine dreidimensionale Farbtabelle für das Transformieren der Pixel des Quellbilds. Die Farbtabelle muss aus Floating-Point-RGBA-Zellen bestehen, die integriertes Alpha verwenden. Die Zellen sind angeordnet in einer Standardanordnung. Die Spalten und Zeilen der Daten sind entsprechend durch Rot und Grün indiziert. Jeder Datenebene folgt die nächsthöhere Ebene in den Daten, wobei die Ebenen durch Blau indiziert sind.";"CIColorInvert" = "Invertiert die Farben in einem Bild.";"CIColorMap" = "Führt eine nicht-lineare Transformation von Quellfarbwerten mithilfe einer Tabelle mit Zuweisungswerten aus.";"CIColorMatrix" = "Integriert Quellfarbwerte und fügt einen Korrekturfaktor zu jeder Farbkomponente hinzu.";"CIColorMonochrome" = "Weist Farben neu zu, sodass sie in Schattierung einer einzelne Farbe fallen.";"CIColorPosterize" = "Weist die Rot-, Grün- und Blau-Farbkomponenten der Anzahl von Helligkeitswerten neu zu, die Sie für jede Farbkomponente festlegen. Dieses Filter reduziert Farben und erzeugt so eine Optik ähnlich der von Siebdruckpostern.";"CIComicEffect" = "Simuliert eine Comic-Heft-Zeichnung durch Hervorheben von Rändern und Anwenden eines Farbhalbtoneffekts.";"CIConstantColorGenerator" = "Erzeugt eine deckende Farbe. Die Ausgabe dieses Filters wird normalerweise als Eingabe für einen weiteren Filter verwendet.";"CICopyMachineTransition" = "Übergang von einem Bild zum nächsten durch Simulation eines Kopierereffekts.";"CICrop" = "Beschneiden eines Bilds. Die Größe und Form des beschnittenen Bilds hängen vom festgelegten Rechteck ab.";"CICrystallize" = "Erzeugt polygone Farbblöcke durch Ermitteln von Quellpixel-Farbwerten.";"CIDiscBlur" = "Glättet oder schärft die Bilddarstellung mithilfe eines scheibenförmigen Faltungskerns.";"CIDisintegrateWithMaskTransition" = "Übergang von einem Bild zum nächsten mithilfe der durch eine Maske festgelegten Form.";"CIDisplacementDistortion" = "Wendet die Graustufenwerte des zweiten Bilds auf das erste Bild an. Die Struktur des resultierenden Bilds wird bestimmt durch die Graustufenwerte.";"CIDissolveTransition" = "Verwendet Überblenden als Übergang von einem Bild zum nächsten.";"CIDotScreen" = "Simuliert ein Punktmuster eines Halbtonrasters.";"CIEdges" = "Finden alle Kanten in einem Bild und stellt sie farbig da.";"CIEdgeWork" = "Erzeugt eine stylisierte SW-Darstellung eines Bilds ähnlich einer Holzschnitzerei.";"CIEightfoldReflectedTile" = "Erzeugt ein gekacheltes Bild aus einem Quellbild durch Anwenden einer 8-fach reflektierten Symmetrie.";"CIExposureAdjust" = "Ändert die Belichtung eines Bildes ähnlich wie beim Einstellen des Blendenwerts einer Kamera.";"CIFalseColor" = "Weist die Leuchtkraft einer Farbrampe mit zwei Farben zu. Falsche Farben werden oft verwendet beim Bearbeiten astronomischer und anderer wissenschaftlicher Daten, z. B. Ultraviolett- und Röntgenbilder.";"CIFastBoxBlur" = "Glättet oder schärft die Bilddarstellung mithilfe eines quaderförmigen Faltungskerns.";"CIFastDiscBlur" = "Glättet oder schärft die Bilddarstellung mithilfe eines scheibenförmigen Faltungskerns.";"CIFlashTransition" = "Übergang von einem Bild zum nächsten durch Erzeugen eines Blitzlichts. Das Blitzlicht geht von einem festgelegten Punkt aus. Der Ursprung ist zunächst klein, breitet sich dann aber sehr schnell aus, bis das gesamte Bild mit der Blitzlichtfarbe ausgefüllt ist. Sobald die Farbe ausgeblendet wird, erscheint nach und nach das Zielbild.";"CIFourfoldReflectedTile" = "Erzeugt ein gekacheltes Bild aus einem Quellbild durch Anwenden einer 4-fach reflektierten Symmetrie.";"CIFourfoldRotatedTile" = "Erzeugt ein gekacheltes Bild aus einem Quellbild durch Drehen des Quellbilds in 90°-Schritten.";"CIFourfoldTranslatedTile" = "Erzeugt ein gekacheltes Bild aus einem Quellbild durch Anwenden einer 4-fachen Übersetzung.";"CIGammaAdjust" = "Passt die Helligkeit der Mitteltöne an. Dieses Filter wird normalerweise verwendet, um nicht-lineare Bildschirmeffekte auszugleichen. Das Anpassen des Gammawerts ändert letztlich die Intensität des Übergangs zwischen Schwarz und Weiß.";"CIGaussianBlur" = "Verteilt Quell-Pixel mit einem festgelegten Wert, der durch Gauß'sche Verteilung ermittelt wird.";"CIGaussianGradient" = "Erzeugt einen Verlauf von einer Farbe zu einer anderen mittels der Gauß'schen Verteilung.";"CIGlassDistortion" = "Verzerrt ein Bild durch Anwenden einer glasähnlichen Struktur. Die angehoben Teile des Ausgabebilds resultieren aus der Strukturzuweisung.";"CIGlassLozenge" = "Erzeugt eine rautenförmige Linse und verzerrt den Teil des Bilds, über dem sich die Linse befindet.";"CIGlideReflectedTile" = "Erzeugt ein gekacheltes Bild aus einem Quellbild durch Übersetzen und Verwischen des Bilds.";"CIGloom" = "Dämpft die hellen Stellen eines Bilds.";"CIHatchedScreen" = "Simuliert ein Linienmuster eines Halbtonrasters.";"CIHeightFieldFromMask" = "Erzeugt ein kontinuierliches Loft-förmiges 3D-Höhenfeld aus einer Graustufenmaske. Die Weißwerte einer Maske definieren die Pixel, die innerhalb des Höhenfelds sind, und die Schwarzwerte definieren die Pixel, die außerhalb sind. Das Feld variiert gleichmäßig und kontinuierlich innerhalb der Maske und erreicht am Rand der Maske den Wert 0. Sie können dieses Filter mit dem Filter „CIShadedMaterial“ verwenden, um extrem realistische Schattenobjekte zu erzeugen.";"CIHexagonalPixellate" = "Stellt ein Bild als farbige Sechsecke an, dessen Farbe ein Mittelwert der Pixel ist, die sie ersetzen.";"CIHoleDistortion" = "Erzeugt einen Kreisbereich, der die Bildpixel nach außen schiebt und so die Pixel, die dem Kreis am nächsten sind, am stärksten verzerrt.";"CIHueAdjust" = "Ändert den Gesamtfarbton der Quellpixel.";"CIKaleidoscope" = "Erzeugt ein Kaleidoskop-Bild aus einem Quellbild durch Anwenden einer 12-fachen Symmetrie.";"CILanczosScaleTransform" = "Erzeugt eine qualitativ hochwertige Version eines Quellbilds. Dieses Filter wird normalerweise zum Verkleinern eines Bilds verwendet.";"CILenticularHaloGenerator" = "Simuliert ein Halo, das durch Beugung mit der Streuung einer Linse erzeugt wird. Dieses Filter wird normalerweise auf ein anderes Bild angewendet, um so einen Blendeneffekt und ähnliche Effekte zu erzielen.";"CILineOverlay" = "Erzeugt eine Skizze, die die Kanten eines Bilds in Schwarz umreißt und die kantenlosen Bereiche des Bilds transparent darstellt. Das Ergebnis enthält Alpha und wird in Schwarz gerendert, sodass es nicht besonders aussieht. Es empfiehlt sich, es anschließendd über ein anderes Bild zu rendern (mithilfe von Source-over-Compositing).";"CILineScreen" = "Simuliert ein Strichmuster eines Halbtonrasters.";"CILinearGradient" = "Erzeugt einen Verlauf, der entlang einer linearen Achse zwischen zwei definierten Endpunkten variiert.";"CIMaskToAlpha" = "Konvertiert ein Graustufenbild in ein weißes Bild mit Alpha-Maske. Die Weißwerte des Quellbilds erzeugen das Innere der Maske, die Schwarzwerte werden komplett transparent.";"CIMaximumCompositing" = "Berechnet den Maximalwert, nach Farbkomponente, für zwei Ausgabebilder und erzeugt ein Ausgabebild mit den Maximalwerten. Dies ähnelt dem Nachbelichten.";"CIMedianFilter" = "Berechnet den Mittelwert für eine Gruppe benachbarter Pixel und ersetzt jedes Pixel durch den Mittelwert. Mit diesem Effekt wird das Rauschen reduziert.";"CIMinimumCompositing" = "Berechnet den Minimalwert, nach Farbkomponente, für zwei Ausgabebilder und erzeugt ein Ausgabebild mit den Minimalwerten. Dies ähnelt dem Brennen.";"CIModTransition" = "Übergang von einem Bild zum nächsten durch Aufdecken des Zielbilds mithilfe unregelmäßig geformter Löcher.";"CIMotionBlur" = "Weichzeichnung des Bilds durch Simulation einer Kamera, die sich während der Aufnahme in einem gegebenen Winkel und eine angegebene Strecke bewegt.";"CIMultiplyCompositing" = "Integriert die Farbkomponente zweier Eingabebilder und erzeugt ein Ausgabebild mit den integrierten Werten. Dieses Filter wird normalerweise verwendet, um ein Spotlight oder einen ähnlichen Lichteffekt zu einem Bild hinzuzufügen.";"CINoiseReduction" = "Reduziert das Rauschen mithilfe eines Schwellenwerts, der das Rauschen definiert. Kleine Änderungen an der Leuchtkraft unterhalb dieses Werts werden als Rauschen interpretiert und es wird entsprechend reduziert, also lokal weichgezeichnet. Änderungen oberhalb des Schwellenwerts werden als Kanten interpretiert und daher mit mehr Schärfe versehen.";"CIOpTile" = "Segmentiert ein Bild mit der festgelegten Skalierung und Rotation und fügt das Bild anschließend wieder zusammen, sodass eine Op-Art-Optik entsteht.";"CIPageCurlTransition" = "Übergang von einem Bild zum nächsten durch Simulation des Umblätterns einer Seite. Das neue Bild erscheint mit dem Umblättern.";"CIParallelogramTile" = "Verzerrt ein Bild durch Reflexion in einem Parallelogramm und kachelt anschließend das Ergebnis.";"CIPerspectiveTile" = "Wendet eine perspektivische Transformierung auf ein Bild an und kachelt das Ergebnis anschließend.";"CIPerspectiveTransform" = "Ändert die Geometrie eines Bilds, um das Verändern des Blickwinkels zu simulieren. Sie können das perspektivische Filter verwenden, um ein Bild perspektivisch zu verändern.";"CIPinchDistortion" = "Erzeugt einen rechteckigen Bereich, der Bildpixel nach innen verzerrt und so die Pixel, die dem Rechteck am nächsten sind, am stärksten verzerrt.";"CIPixellate" = "Erzeugt ein blockhaftes Bild.";"CIPointillize" = "Rendert ein Quellbild in einem pointillistischen Stil.";"CIRadialGradient" = "Erzeugt einen Verlauf, der radial zwischen zwei Kreisen mit demselben Mittelpunkt variert. Einer der beiden Kreise kann für den Radius den Wert 0 haben.";"CIRandomGenerator" = "Erzeugt ein Bild mit unendlicher Ausdehnung, dessen Pixelwerte sich aus vier unabhängigen, gleichmäßig verteilten Zufallswerten im Wertebereich von 0 bis 1 zusammensetzen.";"CIRippleTransition" = "Übergang von einem Bild zum nächsten durch Erzeugen einer kreisförmigen Welle, die sich vom Mittelpunkt ausbreitet und das neue Bild im Nachlauf der Welle freigibt.";"CISepiaTone" = "Weist die Farben eines Bilds verschiedenen Brauntonschattierungen zu.";"CIShadedMaterial" = "Erzeugt ein schattiertes Bild aus einem Höhenfeld. Das Höhenfeld verwendet per Definition hellere Schattierungen bei größeren Höhen und dunklere Schattierungen bei geringeren Höhen (niedrigere Bereiche). Sie können dieses Filter mit dem Filter „CIHeightFieldFromMask“ kombinieren, um schnelle Maskenschattierungen zu erzeugen, z. B. für Text.";"CISharpenLuminance" = "Erhöht die Detaildarstellung durch höhere Schärfe. Die Leuchtkraft des Bilds wird entpsrechend verändert, die Chrominanz der Pixel wird jedoch nicht verändert.";"CISixfoldReflectedTile" = "Erzeugt ein gekacheltes Bild aus einem Quellbild durch Anwenden einer 6-fach reflektierten Symmetrie.";"CISixfoldRotatedTile" = "Erzeugt ein gekacheltes Bild aus einem Quellbild durch Drehen des Quellbilds in 60°-Schritten.";"CISourceAtopCompositing" = "Platziert das Quellbild über dem Hintergrundbild und verwendet dann die Leuchtkraft des Hintergrundbilds, um zu bestimmen, was dargestellt wird. Das Composite zeigt dann das Hintergrundbild und lediglich die Teile des Quellbilds, die sich über den sichtbaren Bereichen des Hintergrunds befinden.";"CISourceInCompositing" = "Verwendet das zweite Bild, um zu bestimmen, was im Quellbild verbleiben soll. Es erfolgt im Grunde ein Beschneiden des Bilds.";"CISourceOutCompositing" = "Verwendet das zweite Bild, um zu bestimmen, was aus dem ersten Bild herausgenommen wird.";"CISourceOverCompositing" = "Platziert das zweite Bild über dem ersten Bild.";"CISpotColor" = "Ersetzt eine oder mehrere Farbbereiche mit Spot-Farben.";"CISpotLight" = "Wendet einen gerichteten Spotlight-Effekt auf ein Bild an.";"CIStarShineGenerator" = "Erzeugt ein Sternenexplosionsmuster. Das Ausgabebild wird normalerweise als Eingabe für ein anderes Filter verwendet.";"CIStripesGenerator" = "Erzeugt ein Streifenmuster. Sie können die Farbe der Streifen, die Streifenbreite sowie den Kontrast festlegen.";"CISunbeamsGenerator" = "Erzeugt einen Sonneneffekt. Die Ausgabe des Sonnenstrahlen-Filters wird normalerweise als Eingabe für ein Composite-Filter verwendet.";"CISwipeTransition" = "Übergang von einem Bild zum nächsten durch Simulation eines Swipe-Effekts.";"CITorusLensDistortion" = "Erzeugt eine ringförmige Linse und verzerrt den Teil des Bilds, über dem sich die Linse befindet.";"CITriangleTile" = "Weist einen Dreiecksausschnitt eines Bilds einem Dreiecksbereich zu und kachelt anschließend das Ergebnis.";"CITwelvefoldReflectedTile" = "Erzeugt ein gekacheltes Bild aus einem Quellbild durch Anwenden einer 12-fach reflektierten Symmetrie.";"CITwirlDistortion" = "Rotiert Pixel um einen Punkt herum, um so einen Wirbeleffekt zu simulieren. Sie können die Anzahl der Rotationen sowie Mittelpunkt und Radius des Effekts festlegen.";"CIUnsharpMask" = "Erhöht den Kontrast der Kanten zwischen unterschiedlich farbigen Pixeln in einem Bild.";"CIVortexDistortion" = "Rotiert Pixel um einen Punkt herum, um einen Strudeleffekt zu simulieren. Sie können die Anzahl der Rotationen sowie Mittelpunkt und Radius des Effekts festlegen.";"CIWhitePointAdjust" = "Passt den Referenz-Weißpunkt für ein Bild an und weist alle Farben in der Quelle mithilfe der neuen Referenz zu.";"CIZoomBlur" = "Simuliert den Effekt des Zoomens mit der Kamera während der Aufnahme des Bilds.";"CIColorBlendMode" = "Verwendet die Leuchtkraftwerte des Hintergunds mit den Farbton- und Sättigungswerten des Quellbilds. In diesem Modus werden die Graustufen im Bild beibehalten.";"CIColorBurnBlendMode" = "Verdunkelt die Hintergrundbild-Samples, um die Quellbild-Samples zu reflektieren. Die Werte der Quellbild-Samples, die „Weiß“ festlegen, bewirken keine Änderung.";"CIColorDodgeBlendMode" = "Hellt die Hintergrundbild-Samples auf, um die Quellbild-Samples zu reflektieren. Die Werte der Quellbild-Samples, die „Schwarz“ festlegen, bewirken keine Änderung.";"CIDarkenBlendMode" = "Erzeugen von Composite-Bild-Samples durch Auswählen der dunkleren Samples (entweder vom Quellbild oder vom Hintergrund). Das Ergebnis ist, dass die Hintergrundbild-Samples ersetzt werden durch Quellbild-Samples, die dunkler sind. Ansonsten bleibt der Hintergrund unverändert.";"CIDifferenceBlendMode" = "Subtrahiert entweder die Quellbild-Samplefarbe von der Hintergrundbild-Samplefarbe oder umgekehrt, je nachdem welches Sample den höheren Helligkeitswert aufweist. Schwarze Quellbild-Samplewerte bewirken keine Änderung, weiße Quellbild-Samplewerte invertieren die Hintergrundfarbwerte.";"CIExclusionBlendMode" = "Erzeugt einen Effekt ähnlich dem des Filters „CIDifferenceBlendMode“, jedoch mit geringerem Kontrast. Schwarze Quellbild-Samplewerte bewirken keine Änderung, weiße Quellbild-Samplewerte invertieren die Hintergrundfarbwerte.";"CIHardLightBlendMode" = "Integriert oder überdeckt Farben, je nach Quellbild-Samplefarbe. Wenn die Quellbild-Samplefarbe heller ist als 50 % Grau, wird der Hintergrund aufgehellt, ähnlich wie beim Überdecken. Wenn die Quellbild-Samplefarbe dunkler ist als 50 % Grau, wird der Hintergrund verdunkelt, ähnlich wie beim Integrieren. Wenn die Quellbild-Samplefarbe gleich 50 % Grau ist, wird die Quelldatei nicht verändert. Bild-Samples, die reinem Schwarz oder reinem Weiß entsprechen, resultieren in reinem Schwarz oder Weiß. Der Gesamteffekt entspricht in etwa dem Beleuchten des Quellbilds mit einem stark fokussierten Spotlight.";"CIHueBlendMode" = "Verwendet die Leuchtkraft- und Sättigungswerte des Hintergrunds mit dem Farbton des Quellbilds.";"CILightenBlendMode" = "Erzeugen von Composite-Bild-Samples durch Auswählen der helleren Samples (entweder vom Quellbild oder vom Hintergrund). Das Ergebnis ist, dass die Hintergrundbild-Samples ersetzt werden durch Quellbild-Samples, die heller sind. Ansonsten bleibt der Hintergrund unverändert.";"CILuminosityBlendMode" = "Verwendet den Farbton und die Sättigung des Hintergrunds mit der Leuchtkraft des Quellbilds. Dieser Modus erzeugt einen Effekt, der sich invers zum Effekt verhält, der mit dem Filter „CIColorBlendMode“ erzeugt wird.";"CIMultiplyBlendMode" = "Integriert die Quellbild-Samples mit den Hintergrundbild-Samples. Dies resultiert in Farben, die mindestens so dunkel sind wie eine der beiden verwendeten Samplefarben.";"CIOverlayBlendMode" = "Integriert oder überdeckt die Quellbild-Samples mit den Hintergrundbild-Samples, je nach Hintergundfarbe. Das Ergebnis ist, dass die vorhandenen Bild-Samples überlagert werden wobei die hellen und dunklen Stellen des Hintergrunds erhalten bleiben. Die Hintergrundfarbe vermischt sich mit dem Quellbild und reflektiert so die hellen und dunklen Stellen des Hintergrunds.";"CISaturationBlendMode" = "Verwendet die Leuchtkraft- und Farbtonwerte des Hintergunds mit der Sättigung des Quellbilds. Bereiche des Hintergrunds, die keine Sättigung aufweisen (z. B. rein graue Bereiche), bewirken keine Änderung.";"CIScreenBlendMode" = "Integriert die invertierten Quellbild-Samples mit den invertierten Hintergrundbild-Samples. Dies resultiert in Farben, die mindestens so hell sind wie eine der beiden verwendeten Samplefarben.";"CISoftLightBlendMode" = "Verdunkelt die Farben oder hellt die Farben auf, je nach Quellbild-Samplefarbe. Wenn die Quellbild-Samplefarbe heller ist als 50 % Grau, wird der Hintergrund aufgehellt, ähnlich wie beim Nachbelichten. Wenn die Quellbild-Samplefarbe dunkler ist als 50 % Grau, wird der Hintergrund verdunkelt, ähnlich wie beim Brennen. Wenn die Quellbild-Samplefarbe gleich 50 % Grau ist, wird der Hintergrund nicht verändert. Bild-Samples, die reinem Schwarz oder reinem Weiß entsprechen, erzeugen hellere oder dunklere Bereiche, resultieren jedoch nicht in reinem Schwarz oder Weiß. Der Gesamteffekt entspricht in etwa dem Beleuchten des Quellbilds mit einem diffusen Spotlight.";"outputImage" = "Das Bild, das von einem Filter erzeugt wird.";"inputBackgroundImage" = "Das Bild, das als Hintergrundbild verwendet wird.";"inputImage" = "Das Bild, das als Eingabebild verwendet wird. Für Filter, die auch ein Hintergrundbild verwenden, ist dies das Vordergrundbild.";"inputTime" = "Die Dauer des Effekts.";"inputTransform" = "Ein Transformation, die angewendet werden soll.";"inputScale" = "Die Stärke des Effekts.";"inputAspectRatio" = "Ein Seitenverhältnis.";"inputCenter" = "Die Mitte des zu filternden Bereichs (als x- und y-Koordinaten).";"inputRadius" = "Die Entfernung zur der Mitte des Effekts.";"inputAngle" = "Ein Winkel.";"inputRefraction" = "Brechzahl des Materials (z. B. Glas), die im Effekt verwendet wird.";"inputWidth" = "Die Breite des Effekts.";"inputSharpness" = "Der Grad der Schärfe, die angewendet werden soll.";"inputIntensity" = "Die Intensität des Effekts.";"inputEV" = "Blendenwerte, um die das Bild heller oder dunkler gemacht werden soll.";"inputSaturation" = "Der Grad der Sättigungsanpassung.";"inputColor" = "Eine Farbe.";"inputBrightness" = "Eine Helligkeitsstufe.";"inputContrast" = "Eine Kontraststufe.";"inputGradientImage" = "Eine Umgebungszuweisung mit Alpha. Normalerweise ist dies ein Bild mit hellen und dunklen Bereichen.";"inputMaskImage" = "Ein Maskenbild.";"inputShadingImage" = "Eine Umgebungszuweisung mit Alphawerten. Normalerweise ist dies ein Bild mit hellen und dunklen Bereichen.";"inputTargetImage" = "Das Zielbild für einen Übergang.";"inputExtent" = "Ein Rechteck, das die Ausdehnung des Effekts bestimmt.";"CIBoxBlur.inputRadius" = "Der Radius bestimmt, wie viele Pixel für das Weichzeichnen verwendet werden. Je größer der Radius, desto stärker das Weichzeichnen.";"CIDiscBlur.inputRadius" = "Der Radius bestimmt, wie viele Pixel für das Weichzeichnen verwendet werden. Je größer der Radius, desto stärker das Weichzeichnen.";"CIGaussianBlur.inputRadius" = "Der Radius bestimmt, wie viele Pixel für das Weichzeichnen verwendet werden. Je größer der Radius, desto stärker das Weichzeichnen.";"CIMotionBlur.inputRadius" ="Der Radius bestimmt, wie viele Pixel für das Weichzeichnen verwendet werden. Je größer der Radius, desto stärker das Weichzeichnen.";"CIMotionBlur.inputAngle" = "Der Winkel der Bewegung bestimmt in welche Richtung das Weichzeichnen verwischt.";"CINoiseReduction.inputNoiseLevel" = "Der Grad der Rauschreduzierung. Je größer der Wert, desto stärker die Rauschreduzierung.";"CINoiseReduction.inputSharpness" = "Die Schärfe des finalen Bilds. Je größer der Wert, desto schärfer das Ergebnis.";"CIZoomBlur.inputCenter" = "Die x- und y-Position, die für die Mitte des Effekts verwendet werden.";"CIZoomBlur.inputAmount" = "Der Grad des Einzoomens. Höhere Werte erzeugen ein stärkeres Einzoomen.";"CIColorControls.inputSaturation" = "Der Grad der Sättigung, die angewendet werden soll. Je größer der Wert, desto satter das Ergebnis.";"CIColorControls.inputBrightness" = "Der Grad der Helligkeit, die angewendet werden soll. Je größer der Wert, desto heller das Ergebnis.";"CIColorControls.inputContrast" = "Der Grad an Kontrast, der angewendet werden soll. Je größer der Wert, desto stärker der Kontrast im resultierenden Bild.";"CIColorMatrix.inputRVector" = "Der Wert für Rot zum Integrieren der Quellfarbwerte.";"CIColorMatrix.inputGVector" = "Der Wert für Grün zum Integrieren der Quellfarbwerte.";"CIColorMatrix.inputBVector" = "Der Wert für Blau zum Integrieren der Quellfarbwerte.";"CIColorMatrix.inputAVector" = "Der Wert für Alpha zum Integrieren der Quellfarbwerte.";"CIColorMatrix.inputBiasVector" = "Ein Vektor, der zu jeder Farbkomponente hinzugefügt wird.";"CIExposureAdjust.inputEV" = "Der Grad für das Anpassen der Belichtung des Bilds. Je größer der Wert, desto heller die Belichtung.";"CIGammaAdjust.inputPower" = "Ein Gammawert, der für die Korrektur der Bildhelligkeit verwendet wird. Je größer der Wert, desto dunkler das Ergebnis.";"CIHueAdjust.inputAngle" = "Ein Winkel (in Grad), der für die Korrektur der Sättigung eines Bilds verwendet wird.";"CIWhitePointAdjust.inputColor" = "Eine Farbe, die als Weißpunkt verwendet wird.";"CIColorCube.inputDimension" = "Die Größe der Farbtabelle.";"CIColorCube.inputCubeData" = "Dies ist eine Farbtabelle für Floating-Point-RGBA-Zellen, die integriertes Alpha verwenden. Die Zellen sind angeordnet in einer Standardanordnung. Die Spalten und Zeilen der Daten sind entsprechend durch Rot und Grün indiziert. Jeder Datenebene folgt die nächsthöhere Ebene in den Daten, wobei die Ebenen durch Blau indiziert sind.";"CIColorMap.inputGradientImage" = "Die Bilddaten dieses Bilds transformieren die Werte des Quellbilds.";"CIColorMonochrome.inputColor" = "Die monochrome Farbe, die auf das Bild angewendet wird.";"CIColorMonochrome.inputIntensity" = "Die Intensität des monochromen Effekts. Ein Wert von 1,0 erzeugt ein monochromes Bild mit der bereitgestellten Farbe. Ein Wert von 0,0 bedeutet kein Effekt für das Bild.";"CIColorPosterize.inputLevels" = "Die Anzahl von Helligkeitsstufen für jede einzelne Farbkomponente. Niedrige Werte resultieren in einem extremeren Postereffekt.";"CIFalseColor.inputColor0" = "Die erste Farbe, die für die Farbrampe verwendet wird.";"CIFalseColor.inputColor1" = "Die zweite Farbe, die für die Farbrampe verwendet wird.";"CISepiaTone.inputIntensity" = "Die Intensität des Sepia-Effekts. Ein Wert von 1,0 erzeugt ein monochromes Sepia-Bild. Ein Wert von 0,0 bedeutet kein Effekt für das Bild.";"CIBumpDistortion.inputCenter" = "Die x- und y-Position, die für die Mitte der Struktur verwendet werden."; "CIBumpDistortion.inputRadius" = "Der Radius bestimmt, wie viele Pixel für das Verzerren verwendet werden. Je größer der Radius, desto stärker das Verzerren."; "CIBumpDistortion.inputScale" = "Die Skala des Effekts bestimmt die Krümmung der Struktur. Ein Wert von 0,0 bedeutet kein Effekt. Positive Werte erzeugen eine nach außen, negative Werte eine nach innen gewölbte Struktur."; "CIBumpDistortionLinear.inputCenter" = "Die x- und y-Position, die für die Mitte der Verzerrung verwendet werden."; "CIBumpDistortionLinear.inputRadius" = "Der Radius bestimmt, wie viele Pixel für das Verzerren verwendet werden. Je größer der Radius, desto stärker das Verzerren.";  "CIBumpDistortionLinear.inputScale" = "Die Skala des Effekts."; "CIBumpDistortionLinear.inputAngle" = "Der Winkel (in Grad) für die Linie, um die herum die Verzerrung auftritt."; "CICircleSplashDistortion.inputCenter" = "Die x- und y-Position, die für die Mitte der Verzerrung verwendet werden.";  "CICircleSplashDistortion.inputRadius" = "Der Radius bestimmt, wie viele Pixel für das Verzerren verwendet werden. Je größer der Radius, desto stärker das Verzerren.";  "CICircularWrap.inputCenter" = "Die x- und y-Position, die für die Mitte der Verzerrung verwendet werden.";  "CICircularWrap.inputRadius" = "Der Radius bestimmt, wie viele Pixel für das Verzerren verwendet werden. Je größer der Radius, desto stärker das Verzerren.";  "CICircularWrap.inputAngle" = "Der Winkel des Effekts."; "CIDisplacementDistortion.inputDisplacementImage" = "Ein Bild, dessen Graustufenwerte auf das Quellbild angewendet werden."; "CIDisplacementDistortion.inputScale" = "Der Auflösungsgrad der Struktur eines resultierenden Bilds. Je größer der Wert, desto größer die Struktur."; "CIGlassDistortion.inputTexture" = "Eine Struktur, die auf das Quellbild angewendet wird.";"CIGlassDistortion.inputCenter" = "Die x- und y-Position, die für die Mitte der Verzerrung verwendet werden."; "CIGlassDistortion.inputScale" = "Der Auflösungsgrad der Struktur eines resultierenden Bilds. Je größer der Wert, desto größer die Struktur."; "CIGlassLozenge.inputPoint0" = "Die x- und y-Position, die den Mittelpunkt eines Kreises an einem Ende der Raute bestimmen."; "CIGlassLozenge.inputPoint1" = "Die x- und y-Position, die den Mittelpunkt eines Kreises am anderen Ende der Raute bestimmen.";  "CIGlassLozenge.inputRadius" = "Der Radius der Raute. Je größer der Radius, desto weiter die Ausbreitung der Verzerrung.";  "CIGlassLozenge.inputRefraction" = "Die Lichtbrechung des Glases."; "CIHoleDistortion.inputCenter" = "Die x- und y-Position, die für die Mitte der Verzerrung verwendet werden.";  "CIHoleDistortion.inputRadius" = "Der Radius bestimmt, wie viele Pixel für das Verzerren verwendet werden. Je größer der Radius, desto stärker das Verzerren.";  "CIPinchDistortion.inputCenter" = "Die x- und y-Position, die für die Mitte der Verzerrung verwendet werden."; "CIPinchDistortion.inputRadius" = "Der Radius bestimmt, wie viele Pixel für das Verzerren verwendet werden. Je größer der Radius, desto stärker das Verzerren."; "CIPinchDistortion.inputScale" = "Der Grad der Verzerrung. Ein Wert von 0,0 bedeutet kein Effekt. Ein Wert von 1,0 bedeutet maximale Verzerrung.";"CITorusLensDistortion.inputCenter" = "Die x- und y-Position, die für die Mitte des Rings verwendet werden.";  "CITorusLensDistortion.inputRadius" = "Der äußere Radius des Rings.";  "CITorusLensDistortion.inputWidth" = "Die Breite des Rings."; "CITorusLensDistortion.inputRefraction" = "Die Lichtbrechung des Glases."; "CITwirlDistortion.inputCenter" = "Die x- und y-Position, die für die Mitte der Verzerrung verwendet werden.";  "CITwirlDistortion.inputRadius" = "Der Radius bestimmt, wie viele Pixel für das Verzerren verwendet werden. Je größer der Radius, desto stärker das Verzerren."; "CITwirlDistortion.inputAngle" = "Der Winkel (in Grad) für den Wirbel. Die Werte können positiv oder negativ sein.";"CIVortexDistortion.inputCenter" = "Die x- und y-Position, die für die Mitte der Verzerrung verwendet werden."; "CIVortexDistortion.inputRadius" = "Der Radius bestimmt, wie viele Pixel für das Verzerren verwendet werden. Je größer der Radius, desto stärker das Verzerren."; "CIVortexDistortion.inputAngle" = "Der Winkel (in Grad) für den Strudel.";"CICheckerboardGenerator.inputColor0" = "Eine Farbe, die für den ersten Satz Felder des Schachbrettmusters verwendet wird.";"CICheckerboardGenerator.inputColor1" = "Eine Farbe, die für den zweiten Satz Felder des Schachbrettmusters verwendet wird.";"CICheckerboardGenerator.inputWidth" = "Die Breite eines Felds im Schachbrettmuster.";"CICheckerboardGenerator.inputSharpness" = "Die Schärfe des Schachbrettmusters. Je kleiner der Wert, desto unschärfer das Muster. Der Wertebereich ist von 0,0 bis 1,0.";"CIConstantColorGenerator.inputColor" = "Die zu erzeugende Farbe."; "CILenticularHaloGenerator.inputCenter" = "Die x- und y-Position, die für die Mitte des Halo verwendet werden.";"CILenticularHaloGenerator.inputHaloRadius" = "Der Radius des Halo.";"CILenticularHaloGenerator.inputHaloWidth" = "Die Breite des Halo, vom inneren Radius zum äußeren Radius.";"CILenticularHaloGenerator.inputOverlap" = "Der Grad der Überlappung der Beugungskomponenten des Halo. Ein Wert von 1,0 bedeutet komplette Überlappung und der Halo ist weiß. Ein Wert von 0,0 bedeutet keine Überlappung und die Halo-Farben überlappen sich nicht.";"CILenticularHaloGenerator.inputStriationStrength" = "Die Intensität der Halo-Farben. Größere Werte erzeugen höhere Intensität.";"CILenticularHaloGenerator.inputStriationContrast" = "Der Kontrast der Halo-Farben. Größere Werte erzeugen höhere Kontraste.";"CIStarShineGenerator.inputCenter" = "Die x- und y-Position, die für die Mitte des Sterns verwendet werden."; "CIStarShineGenerator.inputColor" = "Die Farbe, die für die äußere Hülle des Kreissterns verwendet wird."; "CIStarShineGenerator.inputRadius" = "Der Radius des Sterns."; "CIStarShineGenerator.inputCrossScale" = "Die Größe des Kreuzmusters."; "CIStarShineGenerator.inputCrossAngle" = "Der Winkel des Kreuzmusters."; "CIStarShineGenerator.inputCrossOpacity" = "Die Deckkraft des Kreuzmusters."; "CIStarShineGenerator.inputCrossWidth" = "Die Breite des Kreuzmusters."; "CIStarShineGenerator.inputEpsilon" = "Die Länge der Kreuzlatten."; "CIStripesGenerator.inputCenter" = "Die x- und y-Position, die für die Mitte des Streifenmusters verwendet werden."; "CIStripesGenerator.inputColor0" = "Eine Farbe, die für die ungeradzahligen Streifen verwendet wird."; "CIStripesGenerator.inputColor1" = "Eine Farbe, die für die geradzahligen Streifen verwendet wird.";"CIStripesGenerator.inputWidth" = "Die Breite der Streifen."; "CIStripesGenerator.inputSharpness" = "Die Schärfe des Streifenmusters. Je kleiner der Wert, desto unschärfer das Muster. Der Wertebereich ist von 0,0 bis 1,0."; "CISunbeamsGenerator.inputCenter" = "Die x- und y-Position, die für die Mitte des Sonnenstrahlenmusters verwendet werden.";"CISunbeamsGenerator.inputColor" = "Die Farbe der Sonne.";"CISunbeamsGenerator.inputSunRadius" = "Der Radius der Sonne.";"CISunbeamsGenerator.inputMaxStriationRadius" = "Der Radius der Sonnenstrahlen.";"CISunbeamsGenerator.inputStriationStrength" = "Der Intensität der Sonnenstrahlen. Höhere Werte erzeugen höhere Intensität.";"CISunbeamsGenerator.inputStriationContrast" = "Der Kontrast der Sonnenstrahlen. Höhere Werte erzeugen höhere Kontraste.";"CIAffineTransform.inputTransform" = "Eine Transformierung, die auf das Bild angewendet wird."; "CICrop.inputRectangle" = "Das Rechteck, das den zu beschneidenden Ausschnitt eines Bilds festlegt."; "CILanczosScaleTransform.inputScale" = "Der Skalierungsfaktor, der auf das Bild angewendet wird. Werte kleiner als 1,0 verkleinern das Bild. Werte größer als 1,0 vergrößern das Bild."; "CILanczosScaleTransform.inputAspectRatio" = "Das Bildformat des Bilds."; "CIPerspectiveTransform.inputTopLeft" = "Die Koordinate ganz oben links, der das Bild zugewiesen wird."; "CIPerspectiveTransform.inputTopRight" = "Die Koordinate ganz oben rechts, der das Bild zugewiesen wird."; "CIPerspectiveTransform.inputBottomRight" = "Die Koordinate ganz unten rechts, der das Bild zugewiesen wird."; "CIPerspectiveTransform.inputBottomLeft" = "Die Koordinate ganz unten links, der das Bild zugewiesen wird."; "CIGaussianGradient.inputColor0" = "Die erste Farbe, die für den Verlauf verwendet wird."; "CIGaussianGradient.inputColor1" = "Die zweite Farbe, die für den Verlauf verwendet wird."; "CIGaussianGradient.inputRadius" = "Der Radius für die Gauß'sche Verteilung."; "CILinearGradient.inputPoint0" = "Die Startposition des Verlaufs (wo die erste Farbe beginnt)."; "CILinearGradient.inputPoint1" = "Die Endposition des Verlaufs (wo die zweite Farbe beginnt)."; "CILinearGradient.inputColor0" = "Die erste Farbe, die für den Verlauf verwendet wird.";  "CILinearGradient.inputColor1" = "Die zweite Farbe, die für den Verlauf verwendet wird.";  "CIRadialGradient.inputRadius0" = "Der Radius des Startkreises, der für den Verlauf verwendet wird.";"CIRadialGradient.inputRadius1" = "Der Radius des Endkreises, der für den Verlauf verwendet wird.";"CIRadialGradient.inputColor0" = "Die erste Farbe, die für den Verlauf verwendet wird.";  "CIRadialGradient.inputColor1" = "Die zweite Farbe, die für den Verlauf verwendet wird."; "CICircularScreen.inputCenter" = "Die x- und y-Position, die für die Mitte des konzentrischen Halbtonraster-Musters verwendet werden."; "CICircularScreen.inputWidth" = "Der Abstand zwischen den Kreisen im Muster."; "CICircularScreen.inputSharpness" = "Die Schärfe der Kreise. Je größer der Wert, desto schärfer die Kreise."; "CICMYKHalftone.inputCenter" = "Die x- und y-Position, die für die Mitte des Halbtonmusters verwendet werden.";  "CICMYKHalftone.inputWidth" = "Der Abstand zwischen Punkten im Muster."; "CICMYKHalftone.inputAngle" = "Der Winkel des Musters."; "CICMYKHalftone.inputSharpness" = "Die Schärfe des Musters. Je größer der Wert, desto schärfer das Muster."; "CICMYKHalftone.inputGCR" = "Der Wert für die Graukomponentenersetzung. Der Wertebereich ist von 0,0 (keine Ersetzung) bis 1,0."; "CICMYKHalftone.inputUCR" = "Der Wert für die Unterfarben-Korrektur. Der Wertebereich ist von 0,0 bis 1,0."; "CIDotScreen.inputCenter" = "Die x- und y-Position, die für die Mitte des konzentrischen Punktraster-Musters verwendet werden.";  "CIDotScreen.inputAngle" = "Der Winkel des Musters."; "CIDotScreen.inputWidth" = "Der Abstand zwischen Punkten im Muster."; "CIDotScreen.inputSharpness" = "Die Schärfe des Musters. Je größer der Wert, desto schärfer das Muster."; "CIHatchedScreen.inputCenter" = "Die x- und y-Position, die für die Mitte des schraffierten Halbtonraster-Musters verwendet werden."; "CIHatchedScreen.inputAngle" = "Der Winkel des Musters.";"CIHatchedScreen.inputWidth" = "Der Abstand zwischen Strichen im Muster."; "CIHatchedScreen.inputShaprness" = "Die Schärfe des Musters. Je größer der Wert, desto schärfer das Muster."; "CILineScreen.inputCenter" = "Die x- und y-Position, die für die Mitte des gestrichelten Halbtonraster-Musters verwendet werden.";  "CILineScreen.inputAngle" = "Der Winkel des Musters."; "CILineScreen.inputWidth" = "Der Abstand zwischen Strichen im Muster."; "CILineScreen.inputSharpness" = "Die Schärfe des Musters. Je größer der Wert, desto schärfer das Muster."; 	"CISharpenLuminance.inputSharpness" = "Der Grad der anzuwendenden Schärfe. Größere Werte erzeugen höhere Schärfe.";"CIUnsharpMask.inputRadius" = "Der Radius um ein bestimmtes Pixel für die Unschärfemaske. Je größer der Radius, desto größer der betroffene Bildteil.";"CIUnsharpMask.inputIntensity" = "Die Intensität des Effekts. Je größer der Wert, desto höher der Kontrast im Wirkungsbereich des Effekts.";"CIBlendWithMask.inputMaskImage" = "Eine Graustufenmaske. Bei einem Maskenwert von 0,0 resultiert daraus der Hintergrund. Bei einem Maskenwert von 1,0 resultiert daraus das Bild."; "CIBloom.inputRadius" = "Der Radius bestimmt, wie viele Pixel für das Erzeugen des Effekts verwendet werden. Je größer der Radius, desto größer der Effekt.";"CIBloom.inputIntensity" = "Die Intensität des Effekts. Ein Wert von 0,0 bedeutet kein Effekt. Ein Wert von 1,0 bedeutet maximaler Effekt."; "CICrystallize.inputRadius" = "Der Radius bestimmt, wie viele Pixel für das Erzeugen des Effekts verwendet werden. Je größer der Radius, desto größer die resultierenden Kristalle."; "CIEdges.inputIntensity" = "Die Intensität der Kanten. Je größer der Wert, desto höher die Intensität."; "CIEdgeWork.inputRadius" = "Die Dicke der Kanten. Je größer der Wert, desto dicker die Kanten."; "CIGloom.inputRadius" = "Der Radius bestimmt, wie viele Pixel für das Erzeugen des Effekts verwendet werden. Je größer der Radius, desto größer der Effekt."; "CIGloom.inputIntensity" = "Die Intensität des Effekts. Ein Wert von 0,0 bedeutet kein Effekt. Ein Wert von 1,0 bedeutet maximaler Effekt."; "CIHeightFieldFromMask.inputImage" = "Die Weißwerte einer Maske definieren die Pixel, die innerhalb des Höhenfelds sind, und die Schwarzwerte definieren die Pixel, die außerhalb sind. Das Feld variiert gleichmäßig und kontinuierlich innerhalb der Maske und erreicht am Rand der Maske den Wert 0."; "CIHeightFieldFromMask.inputRadius" = "Der Abstand vom Rand der Maske für den gleichmäßigen Übergang ist proportional zum Eingaberadius. Größere Werte sorgen für einen gleichmäßigen und ausgeprägten Übergang. Kleinere Werte sorgen für einen Übergang, der sich einem Hohlkehlenradius annähert."; "CIHexagonalPixellate.inputCenter" = "Die x- und y-Position, die für die Mitte des Effekts verwendet werden."; "CIHexagonalPixellate.inputScale" = "Die Skala bestimmt die Größe der Sechsecke. Größere Werte resultieren in größeren Sechsecken."; "CILineOverlay.inputNRNoiseLevel" = "Der Rauschpegel des Bilds (verwendet mit Kameradaten), der entfernt wird, bevor die Kanten des Bilds gesucht werden. Das Erhöhen des Rauschpegels hilft, die gefunden Kanten des Bilds zu bereinigen."; "CILineOverlay.inputNRSharpness" = "Der Grad der Schärfung beim Entfernen des Rauschens im Bild, bevor nach den Kanten des Bilds gesucht wird. Dies verbessert das Kanten-Handling."; "CILineOverlay.inputEdgeIntensity" = "Der hervorgehobene Faktor der Sobel-Verlaufsinformationen beim Suchen nach Kanten des Bilds. Mit höheren Werten werden mehr Kanten gefunden, auch wenn normalerweise ein niedrigerer Wert (z. B. 1,0) verwendet wird."; "CILineOverlay.inputThreshold" = "Dieser Wert bestimmt die Sichtbarkeit der Kanten. Größere Werte dünnen die Kanten aus."; "CILineOverlay.inputContrast" = "Der Grad des Anti-Aliasing, der auf die Kanten angewendet wird, die durch dieses Filter erzeugt werden. Höhere Werte erzeugen kontrastreichere Kanten (also mit geringerem Anti-Aliasing)."; "CIPixellate.inputCenter" = "Die x- und y-Position, die für die Mitte des Effekts verwendet werden.";  "CIPixellate.inputScale" = "Die Skala bestimmt die Größe der Quadrate. Größere Werte resultieren in größeren Quadraten."; "CIPointillize.inputRadius" = "Der Radius der Kreise im resultierenden Muster."; "CIPointillize.inputCenter" = "Die x- und y-Position, die für die Mitte des Effekts verwendet werden.";  "CIShadedMaterial.inputShadingImage" = "Das Bild, das als Höhenfeld verwendet wird. Das resultierende Bild verwendet für größere Höhen hellere Schattierungen und für geringere Höhen (niedrigere Bereiche) dunklere Schattierungen."; "CIShadedMaterial.inputScale" = "Die Skala des Effekts. Je größer der Wert, desto dramatischer wirkt der Effekt."; "CISpotColor.inputCenterColor1" = "Der Mittenwert des ersten Farbbereichs, der ersetzt wird."; "CISpotColor.inputReplacementColor1" = "Eine Ersetzungsfarbe für den ersten Farbbereich."; "CISpotColor.inputCloseness1" = "Ein Wert, der anzeigt, wie genau die erste Farbe übereinstimmen muss, damit das Ersetzen erfolgt."; "CISpotColor.inputContrast1" = "Der Kontrast der ersten Ersetzungsfarbe."; "CISpotColor.inputCenterColor2" = "Der Mittenwert des zweiten Farbbereichs, der ersetzt wird."; "CISpotColor.inputReplacementColor2" = "Eine Ersetzungsfarbe für den zweiten Farbbereich.";"CISpotColor.inputCloseness2" = "Ein Wert, der anzeigt, wie genau die zweite Farbe übereinstimmen muss, damit das Ersetzen erfolgt."; "CISpotColor.inputContrast2" = "Der Kontrast der zweiten Ersetzungsfarbe."; "CISpotColor.inputCenterColor3" = "Der Mittenwert des dritten Farbbereichs, der ersetzt wird.";  "CISpotColor.inputReplacementColor3" = "Eine Ersetzungsfarbe für den dritten Farbbereich."; "CISpotColor.inputCloseness3" = "Ein Wert, der anzeigt, wie genau die dritte Farbe übereinstimmen muss, damit das Ersetzen erfolgt.";  "CISpotColor.inputContrast3" = "Der Kontrast der dritten Ersetzungsfarbe.";  "CISpotLight.inputLightPosition" = "Die x- und y-Position des Spotlights."; 		"CISpotLight.inputLightPointsAt" = "Die x- und y-Position, auf die das Spotlight strahlt.";  "CISpotLight.inputBrightness" = "Die Helligkeit des Spotlights."; "CISpotLight.inputConcentration" = "Die Größe des Spotlights. Je kleiner der Wert, desto schmaler, fokussierter ist der Lichtkegel."; "CISpotLight.inputColor" = "Die Farbe des Spotlights."; "CIAffineClamp.inputTransform" = "Die Transformierung, die auf das Bild angewendet wird."; "CIAffineTile.inputTransform" = "Die Transformierung, die auf das Bild angewendet wird."; "CIEightfoldReflectedTile.inputCenter" = "Die x- und y-Position, die für die Mitte des Effekts verwendet werden.";  "CIEightfoldReflectedTile.inputAngle" = "Der Winkel (in Grad) für das Kachelmuster."; "CIEightfoldReflectedTile.inputWidth" = "Die Breite der Kacheln."; "CIFourfoldReflectedTile.inputCenter" = "Die x- und y-Position, die für die Mitte des Effekts verwendet werden.";  "CIFourfoldReflectedTile.inputAngle" = "Der Winkel (in Grad) für das Kachelmuster.";  "CIFourfoldReflectedTile.inputAcuteAngle" = "Der Hauptwinkel für die wiederholt reflektierte Kachel. Kleine Werte erzeugen dünne diamantförmige Kacheln, hohe Werte erzeugen dickere reflektierte Kacheln."; "CIFourfoldReflectedTile.inputWidth" = "Die Breite der Kacheln.";  "CIFourfoldRotatedTile.inputCenter" = "Die x- und y-Position, die für die Mitte des Effekts verwendet werden.";  "CIFourfoldRotatedTile.inputAngle" = "Der Winkel (in Grad) für das Kachelmuster.";  "CIFourfoldRotatedTile.inputWidth" = "Die Breite der Kacheln."; "CIFourfoldTranslatedTile.inputCenter" = "Die x- und y-Position, die für die Mitte des Effekts verwendet werden.";  "CIFourfoldTranslatedTile.inputAngle" = "Der Winkel (in Grad) für das Kachelmuster.";  "CIFourfoldTranslatedTile.inputAcuteAngle" = "Der Hauptwinkel für die wiederholt versetzte Kachel. Kleine Werte erzeugen dünne diamantförmige Kacheln, hohe Werte erzeugen dickere versetzte Kacheln."; "CIFourfoldTranslatedTile.inputWidth" = "Die Breite der Kacheln.";  "CIGlideReflectedTile.inputCenter" = "Die x- und y-Position, die für die Mitte des Effekts verwendet werden.";  "CIGlideReflectedTile.inputAngle" = "Der Winkel (in Grad) für das Kachelmuster.";  "CIGlideReflectedTile.inputWidth" = "Die Breite der Kacheln.";  "CIKaleidoscope.inputCount" = "Die Anzahl der Reflexionen im Muster."; "CIKaleidoscope.inputCenter" = "Die x- und y-Position, die für die Mitte des Effekts verwendet werden.";  "CIKaleidoscope.inputAngle" = "Der Winkel der Reflexion."; "CIOpTile.inputCenter" = "Die x- und y-Position, die für die Mitte des Effekts verwendet werden.";  "CIOpTile.inputScale" = "Die Skala bestimmt die Anzahl der Kacheln im Effekt."; "CIOpTile.inputAngle" = "Der Winkel der Kacheln."; "CIOpTile.inputWidth" = "Die Breite der Kacheln."; "CIParallelogramTile.inputCenter" = "Die x- und y-Position, die für die Mitte des Effekts verwendet werden."; "CIParallelogramTile.inputAngle" = "Der Winkel (in Grad) für das Kachelmuster.";  "CIParallelogramTile.inputAcuteAngle" = "Der Hauptwinkel für die wiederholte Parallelogramm-Kachel. Kleine Werte erzeugen dünne diamantförmige Kacheln, hohe Werte erzeugen dickere Parallelogramm-Kacheln."; "CIParallelogramTile.inputWidth" = "Die Breite der Kacheln.";  "CIPerspectiveTile.inputTopLeft" = "Die Koordinate ganz oben links einer Kachel."; "CIPerspectiveTile.inputTopRight" = "Die Koordinate ganz oben rechts einer Kachel.";"CIPerspectiveTile.inputBottomRight" = "Die Koordinate ganz unten rechts einer Kachel."; "CIPerspectiveTile.inputBottomLeft" = "Die Koordinate ganz unten links einer Kachel."; "CISixfoldReflectedTile.inputCenter" = "Die x- und y-Position, die für die Mitte des Effekts verwendet werden.";  "CISixfoldReflectedTile.inputAngle" = "Der Winkel (in Grad) für das Kachelmuster.";  "CISixfoldReflectedTile.inputWidth" = "Die Breite der Kacheln."; "CISixfoldRotatedTile.inputCenter" = "Die x- und y-Position, die für die Mitte des Effekts verwendet werden."; "CISixfoldRotatedTile.inputAngle" = "Der Winkel (in Grad) für das Kachelmuster.";  "CISixfoldRotatedTile.inputWidth" = "Die Breite der Kacheln.";  "CITriangleTile.inputCenter" = "Die x- und y-Position, die für die Mitte des Effekts verwendet werden.";  "CITriangleTile.inputAngle" = "Der Winkel (in Grad) für das Kachelmuster.";  "CITriangleTile.inputWidth" = "Die Breite der Kacheln.";  "CITwelvefoldReflectedTile.inputCenter" = "Die x- und y-Position, die für die Mitte des Effekts verwendet werden."; "CITwelvefoldReflectedTile.inputAngle" = "Der Winkel (in Grad) für das Kachelmuster.";"CITwelvefoldReflectedTile.inputWidth" = "Die Breite der Kacheln."; "CIBarsSwipeTransition.inputAngle" = "Der Winkel (in Grad) für die Balken.";	"CIBarsSwipeTransition.inputWidth" = "Die Breite der Balken.";	"CIBarsSwipeTransition.inputBarOffset" = "Der Versatz zwischen den einzelnen Balken.";	"CIBarsSwipeTransition.inputTime" = "Die parametrische Zeit des Übergangs. Dieser Wert führt den Übergang vom Start (bei Zeit = 0) zum Ende (bei Zeit = 1).";"CICopyMachineTransition.inputColor" = "Die Farbe des Kopierlichts.";"CICopyMachineTransition.inputAngle" = "Der Winkel des Kopierlichts.";"CICopyMachineTransition.inputWidth" = "Die Breite des Kopierlichts.";"CICopyMachineTransition.inputOpacity" = "Die Deckkraft des Kopierlichts. Ein Wert von 0,0 bedeutet Transparenz. Ein Wert von 1,0 bedeutet volle Deckkraft.";"CICopyMachineTransition.inputTime" = "Die parametrische Zeit des Übergangs. Dieser Wert führt den Übergang vom Start (bei Zeit = 0) zum Ende (bei Zeit = 1).";"CIDisintegrateWithMaskTransition.inputMaskImage" = "Ein Bild, das die Form bestimmt, die beim Wechsel von Quell- zu Zielbild verwendet wird.";"CIDisintegrateWithMaskTransition.inputShadowRadius" = "Der Radius des Schattens, der durch die Maske entsteht.";"CIDisintegrateWithMaskTransition.inputShadowDensity" = "Die Dichte des Schattens, der durch die Maske entsteht.";"CIDisintegrateWithMaskTransition.inputShadowOffset" = "Der Versatz des Schattens, der durch die Maske entsteht.";"CIDisintegrateWithMaskTransition.inputTime" = "Die parametrische Zeit des Übergangs. Dieser Wert führt den Übergang vom Start (bei Zeit = 0) zum Ende (bei Zeit = 1).";"CIDissolveTransition.inputTime" = "Die parametrische Zeit des Übergangs. Dieser Wert führt den Übergang vom Start (bei Zeit = 0) zum Ende (bei Zeit = 1).";"CIFlashTransition.inputCenter" = "Die x- und y-Position, die für die Mitte des Effekts verwendet werden."; "CIFlashTransition.inputExtent" = "Die Ausbreitung des Blitzlichts.";"CIFlashTransition.inputColor" = "Die Farbe der Lichtstrahlen, die vom Blitzlicht ausstrahlen.";"CIFlashTransition.inputMaxStriationRadius" = "Der Radius der Lichtstrahlen, die vom Blitzlicht ausstrahlen.";"CIFlashTransition.inputStriationStrength" = "Die Stärke der Lichtstrahlen, die vom Blitzlicht ausstrahlen.";"CIFlashTransition.inputStriationContrast" = "Der Kontrast der Lichtstrahlen, die vom Blitzlicht ausstrahlen.";"CIFlashTransition.inputFadeThreshold" = "Der Grad des Überblendens zwischen dem Blitzlicht und dem Zielbild. Je höher der Wert, desto länger die Blitzzeit und und desto kürzer die Überblendzeit.";"CIFlashTransition.inputTime" = "Die parametrische Zeit des Übergangs. Dieser Wert führt den Übergang vom Start (bei Zeit = 0) zum Ende (bei Zeit = 1).";"CIModTransition.inputCenter" = "Die x- und y-Position, die für die Mitte des Effekts verwendet werden."; "CIModTransition.inputAngle" = "Der Winkel des Mod-Hole-Musters.";"CIModTransition.inputRadius" = "Der Radius der nicht verzerrten Löcher im Muster.";"CIModTransition.inputCompression" = "Der Grad des Dehnens, der auf das Mod-Hole-Muster angewendet wird. Löcher in der Mitte werden nicht so stark verzerrt wie die am Rand des Bilds.";"CIModTransition.inputTime" = "Die parametrische Zeit des Übergangs. Dieser Wert führt den Übergang vom Start (bei Zeit = 0) zum Ende (bei Zeit = 1).";"CIPageCurlTransition.inputBacksideImage" = "Das Bild, das auf der Rückseite des Quellbilds erscheint, wenn die Seite umgeblättert wird und den Blick auf das Zielbild freigibt.";"CIPageCurlTransition.inputShadingImage" = "Ein Bild, das aussieht wie eine schattierte Kugel in einem quadratischen Bild.";"CIPageCurlTransition.inputExtent" = "Die Ausdehnung des Effekts.";"CIPageCurlTransition.inputAngle" = "Der Winkel der umgeblätterten Seite.";"CIPageCurlTransition.inputRadius" = "Der Radius des Umblätterns.";"CIPageCurlTransition.inputTime" = "Die parametrische Zeit des Übergangs. Dieser Wert führt den Übergang vom Start (bei Zeit = 0) zum Ende (bei Zeit = 1).";"CIRippleTransition.inputShadingImage" = "Ein Bild, das aussieht wie eine schattierte Kugel in einem quadratischen Bild.";"CIRippleTransition.inputCenter" = "Die x- und y-Position, die für die Mitte des Effekts verwendet werden."; "CIRippleTransition.inputExent" = "Die Ausdehnung des Effekts.";"CIRippleTransition.inputWidth" = "Die Breite der Wellenform.";"CIRippleTransition.inputScale" = "Ein Wert, der bestimmt, ob die Wellenform als Wölbung (höherer Wert) oder als Vertiefung (niedrigerer Wert) beginnt.";"CIRippleTransition.inputTime" = "Die parametrische Zeit des Übergangs. Dieser Wert führt den Übergang vom Start (bei Zeit = 0) zum Ende (bei Zeit = 1).";"CISwipeTransition.inputExtent" = "Die Ausdehnung des Effekts.";"CISwipeTransition.inputColor" = "Die Farbe des Swipe-Effekts.";"CISwipeTransition.inputAngle" = "Der Winkel des Swipe-Effekts.";"CISwipeTransition.inputWidth" = "Die Breite des Swipe-Effekts.";"CISwipeTransition.inputOpacity" = "Die Deckkraft des Swipe-Effekts.";"CISwipeTransition.inputTime" = "Die parametrische Zeit des Übergangs. Dieser Wert führt den Übergang vom Start (bei Zeit = 0) zum Ende (bei Zeit = 1).";"CIAreaHistogram" = "Berechnet ein Histogramm für den festgelegten Bildaussschnitt und gibt das Ergebnis in einem 1D-Bild aus.";"CIAreaHistogram.inputExtent" = "Ein Rechteck, das den Ausschnitt eines Bilds festlegt, der bearbeitet werden soll.";"CIAreaHistogram.inputCount" = "Die Anzahl an Bins für das Histogramm.";"CIAreaHistogram.inputImage" = "Das Bild, dessen Histogramm Sie berechnen möchten.";"CIAreaHistogram.inputScale" = "Der Skalenwert, den Sie für die Histogrammwerte verwenden möchten.";"CIAreaMaximum" = "Berechnet die maximalen Komponentenwerte für den festgelegten Bildaussschnitt und gibt das Ergebnis in einem Pixel aus.";"CIAreaMaximum.inputExtent" = "Ein Rechteck, das den Ausschnitt eines Bilds festlegt, der bearbeitet werden soll.";"CIAreaMaximum.inputImage" = "Zu bearbeitendes Bild.";"CIAreaMinimum" = "Berechnet die minimalen Komponentenwerte für den festgelegten Bildaussschnitt und gibt das Ergebnis in einem Pixel aus.";"CIAreaMinimum.inputExtent" = "Ein Rechteck, das den Ausschnitt eines Bilds festlegt, der bearbeitet werden soll.";"CIAreaMinimum.inputImage" = "Zu bearbeitendes Bild.";"CIAreaMaximumAlpha" = "Sucht das Pixel mit dem maximalen Alpha-Wert und gibt dieses aus.";"CIAreaMaximumAlpha.inputExtent" = "Ein Rechteck, das den Ausschnitt eines Bilds festlegt, der bearbeitet werden soll.";"CIAreaMaximumAlpha.inputImage" = "Zu bearbeitendes Bild.";"CIAreaMinimumAlpha" = "Sucht das Pixel mit dem minimalen Alpha-Wert und gibt dieses aus.";"CIAreaMinimumAlpha.inputExtent" = "Ein Rechteck, das den Ausschnitt eines Bilds festlegt, der bearbeitet werden soll.";"CIAreaMinimumAlpha.inputImage" = "Zu bearbeitendes Bild.";"CIAreaAverage" = "Berechnet den Durchschnittsfarbwert für den festgelegten Bildaussschnitt und gibt das Ergebnis in einem Pixel aus.";"CIAreaAverage.inputExtent" = "Ein Rechteck, das den Ausschnitt eines Bilds festlegt, der bearbeitet werden soll.";"CIAreaAverage.inputImage" = "Zu bearbeitendes Bild.";"CIRowAverage" = "Berechnet den Durchschnittsfarbwert für jede Zeile des festgelegten Bildaussschnitts und gibt das Ergebnis in einem 1D-Bild aus.";"CIRowAverage.inputExtent" = "Ein Rechteck, das den Ausschnitt eines Bilds festlegt, der bearbeitet werden soll.";"CIRowAverage.inputImage" = "Zu bearbeitendes Bild.";"CIColumnAverage" = "Berechnet den Durchschnittsfarbwert für jede Spalte des festgelegten Bildaussschnitts und gibt das Ergebnis in einem 1D-Bild aus.";"CIColumnAverage.inputExtent" = "Ein Rechteck, das den Ausschnitt eines Bilds festlegt, der bearbeitet werden soll.";"CIColumnAverage.inputImage" = "Zu bearbeitendes Bild.";"CIMinimumComponent" = "Konvertiert ein Bild in Graustufen mithilfe des Minimums aus den drei Farbkomponenten.";"CIMinimumComponent.inputExtent" = "Ein Rechteck, das den Ausschnitt eines Bilds festlegt, der bearbeitet werden soll.";"CIMinimumComponent.inputImage" = "Zu bearbeitendes Bild.";"CIMaximumComponent" = "Konvertiert ein Bild in Graustufen mithilfe des Maximums aus den drei Farbkomponenten.";"CIMaximumComponent.inputExtent" = "Ein Rechteck, das den Ausschnitt eines Bilds festlegt, der bearbeitet werden soll.";"CIMaximumComponent.inputImage" = "Zu bearbeitendes Bild.";